function change_area(area){
	for (var c in city){
		if (city[c][0]==area)
		{
			for(i=document.all.city.options.length-1;i>=0;i--)
			{
				document.all.city.options.remove(i);
			}

			city_name = city[c][1].split(",");
			city_value = city[c][2].split(",");
			for (var i=0;i<city_name.length;i++)
			{
				document.all.city.options.add(new Option(city_name[i],city_value[i])); 
			}

		}
	}
}

var area_text = new Array();
var area_value = new Array();
var city=new Array();

var citynum=0;

area_value[citynum]='11910';
area_text[citynum]='上海市';
city[0]=new Array('11910','卢湾区,徐汇区,浦东新区,闸北区,长宁区,金山区,青浦区,宝山区,崇明县,杨浦区,南汇区,静安区,奉贤区,虹口区,黄浦区,嘉定区,上海市区,闵行区,普陀区,松江区','12210,12228,12212,12213,12214,12215,12216,12217,12218,12220,12221,12222,12223,12224,12225,12226,12749,12219,12227,12211');

citynum++;
area_value[citynum]='11905';
area_text[citynum]='北京';
city[1]=new Array('11905','朝阳区,西城区,崇文区,石景山区,宣武区,丰台区,延庆县,东城区,海淀区,北京市,密云县,通州区,昌平区','12335,12336,12339,12340,12341,12342,12338,12344,12345,12346,12347,12337,12343');

citynum++;
area_value[citynum]='11906';
area_text[citynum]='广东';
city[2]=new Array('11906','佛山,河源,湛江,云浮,深圳,东莞,汕头,江门,揭阳,梅州,茂名,潮州,清远,汕尾,惠州,阳江,中山,广州市区,韶关,肇庆','11967,11977,11969,11970,11971,11972,11973,11974,11975,11978,11979,11980,11981,11982,11983,11984,11986,11985,11976,11968');

citynum++;
area_value[citynum]='31958';
area_text[citynum]='深圳';
city[3]=new Array('31958','盐田区,宝安区,南山区,龙岗区,罗湖区,福田区','31972,31973,31977,31975,31976,31974');

citynum++;
area_value[citynum]='11882';
area_text[citynum]='山东';
city[4]=new Array('11882','德州,济南,威海,东营,济宁,莱芜,菏泽,滨州,泰安,淄博,潍坊,枣庄,临沂,烟台,聊城,青岛,日照','12170,12174,12172,12175,12176,12177,12178,12179,12180,12181,12182,12183,12184,12185,12186,12173,12171');


citynum++;
area_value[citynum]='11884';
area_text[citynum]='云南';
city[5]=new Array('11884','红河哈尼族彝族自治州,西双版纳傣族自治州,玉溪,怒江傈傈族自治州,大理白族自治州,昆明,德宏傣族景颇族自治州,迪庆藏族自治州,曲靖,临沧,思茅,保山,丽江,楚雄彝族自治州,昭通,文山壮族苗族自治州','12280,12295,12283,12284,12285,12288,12289,12291,12292,12282,12286,12290,12294,12287,12293,12281');



citynum++;
area_value[citynum]='11885';
area_text[citynum]='江苏';
city[6]=new Array('11885','扬州,张家港,徐州,盐城,苏州,无锡,镇江,淮安,南京,南通,常州,泰州,宿迁,江阴,连云港','12111,37230,12114,12115,12117,12118,12119,12121,12122,12110,12112,12116,12120,37229,12113');



citynum++;
area_value[citynum]='11886';
area_text[citynum]='内蒙古';
city[7]=new Array('11886','呼伦贝尔,赤峰,鄂尔多斯,乌海,包头,兴安盟,通辽,巴彦淖尔盟,锡林郭勒盟,阿拉善盟,乌兰察布,呼和浩特','12148,12149,12150,12151,12154,12153,12157,12158,12147,12152,12155,12156');



citynum++;
area_value[citynum]='11887';
area_text[citynum]='天津';
city[8]=new Array('11887','河西区,塘沽区,和平区,天津,河北区,南开区,河东区','12250,12251,12252,12253,12255,12256,12254');



citynum++;
area_value[citynum]='11888';
area_text[citynum]='广西';
city[9]=new Array('11888','玉林,来宾,崇左,北海,贵港,南宁,防城港,钦州,梧州,柳州,百色,河池,桂林,贺州','11987,11988,11989,11990,11991,11992,11995,11996,11997,11998,11999,12000,11994,11993');



citynum++;
area_value[citynum]='11889';
area_text[citynum]='浙江';
city[10]=new Array('11889','湖州,嘉兴,舟山,台州,宁波,金华,丽水,杭州,衢州,温州,绍兴','12296,12297,12299,12300,12301,12305,12304,12306,12298,12302,12303');



citynum++;
area_value[citynum]='11890';
area_text[citynum]='甘肃';
city[11]=new Array('11890','张掖,甘南藏族自治州,酒泉,金昌,天水,白银,临夏回族自治州,嘉峪关,武威,平凉,兰州,陇南,定西,庆阳','11955,11956,11957,11958,11959,11960,11966,11962,11963,11964,11965,11953,11954,11961');



citynum++;
area_value[citynum]='11891';
area_text[citynum]='黑龙江';
city[12]=new Array('11891','绥化,大兴安岭,哈尔滨,黑河,佳木斯,大庆,牡丹江,七台河,齐齐哈尔,鹤岗,鸡西,双鸭山,伊春','12067,12068,12069,12070,12071,12072,12079,12074,12075,12076,12077,12078,12073');



citynum++;
area_value[citynum]='11892';
area_text[citynum]='海南';
city[13]=new Array('11892','陵水黎族自治县,澄迈县,琼中黎族苗族自治县,海口,屯昌县,琼海,保亭黎族苗族自治县,乐东黎族自治县,三亚,万宁,儋州,文昌,昌江黎族自治县,临高县,白沙黎族自治县,五指山,定安县,东方','12010,12026,12012,12013,12014,12015,12018,12019,12020,12021,12022,12023,12024,12025,12009,12016,12017,12011');



citynum++;
area_value[citynum]='11893';
area_text[citynum]='贵州';
city[14]=new Array('11893','铜仁,遵义,黔东南苗族侗族自治州,黔西南布依族苗族自治州,安顺,六盘水,贵阳,毕节','12001,12002,12003,12005,12006,12007,12008,12004');



citynum++;
area_value[citynum]='11895';
area_text[citynum]='湖北';
city[15]=new Array('11895','仙桃,潜江,黄冈,天门,孝感,神农架林区,咸宁,随州,十堰,恩施土家族苗族自治州,襄樊,荆门,宜昌,荆州,武汉,黄石,鄂州','12080,12096,12082,12083,12084,12085,12086,12087,12088,12090,12091,12095,12089,12092,12093,12094,12081');



citynum++;
area_value[citynum]='11896';
area_text[citynum]='河北';
city[16]=new Array('11896','邢台,张家口,承德,石家庄,秦皇岛,廊坊,邯郸,保定,沧州,唐山,衡水','12027,12028,12029,12030,12031,12035,12033,12036,12037,12034,12032');



citynum++;
area_value[citynum]='11897';
area_text[citynum]='西藏';
city[17]=new Array('11897','日喀则,林芝,阿里,拉萨,那曲,山南,昌都','12258,12259,12260,12263,12261,12262,12257');



citynum++;
area_value[citynum]='11898';
area_text[citynum]='湖南';
city[18]=new Array('11898','湘西土家族苗族自治州,张家界,邵阳,益阳,怀化,永州,株洲,常德,郴州,娄底,长沙,湘潭,衡阳','12097,12098,12099,12101,12102,12103,12104,12106,12107,12108,12109,12100,12105');



citynum++;
area_value[citynum]='11899';
area_text[citynum]='福建';
city[19]=new Array('11899','厦门,莆田,泉州,龙岩,宁德,南平,三明,漳州,福州','11944,11945,11946,11947,11952,11949,11950,11951,11948');



citynum++;
area_value[citynum]='11900';
area_text[citynum]='河南';
city[20]=new Array('11900','平顶山,安阳,信阳,焦作,驻马店,鹤壁,南阳,许昌,开封,郑州,洛阳,濮阳,新乡,漯河,商丘,济源,三门峡','12050,12062,12052,12053,12054,12055,12056,12057,12058,12059,12060,12063,12064,12065,12066,12061,12051');



citynum++;
area_value[citynum]='11901';
area_text[citynum]='新疆';
city[21]=new Array('11901','阿拉尔,巴音郭楞蒙古自治州,博尔塔拉蒙古自治州,乌鲁木齐,五家渠,阿克苏,和田,克孜勒苏柯尔克孜自治州,伊犁哈萨克自治州,图木舒克,喀什,昌吉回族自治州,吐鲁番,克拉玛依,哈密,石河子','12264,12277,12267,12268,12270,12271,12272,12273,12275,12279,12265,12269,12274,12278,12276,12266');



citynum++;
area_value[citynum]='11902';
area_text[citynum]='安徽';
city[22]=new Array('11902','芜湖,合肥,池州,亳州,淮南,滁州,马鞍山,蚌埠,铜陵,六安,淮北,阜阳,黄山,宿州,宣城,巢湖','11912,11921,11914,11915,11916,11917,11918,11919,11922,11923,11924,11925,11926,11927,11920,11913');



citynum++;
area_value[citynum]='11903';
area_text[citynum]='辽宁';
city[23]=new Array('11903','铁岭,抚顺,盘锦,本溪,朝阳,鞍山,丹东,大连,沈阳,锦州,阜新,辽阳,葫芦岛,营口','12133,12134,12135,12137,12138,12140,12144,12142,12143,12145,12146,12136,12139,12141');






citynum++;
area_value[citynum]='11907';
area_text[citynum]='吉林';
city[24]=new Array('11907','长春,吉林,辽源,延边朝鲜族自治州,四平,通化,白城,白山','12349,12350,12351,12348,12353,12354,12355,12352');



citynum++;
area_value[citynum]='11908';
area_text[citynum]='重庆';
city[25]=new Array('11908','开县,垫江县,合川市,巫山县,巫溪县,石柱土家族自治县,云阳县,梁平县,綦江县,大足县,忠县,武隆县,璧山县,丰都县,城口县,彭水苗族土家族自治县,重庆市,酉阳土家族苗族自治县,秀山土家族苗族自治县,江津市,铜梁县,南川市,奉节县,永川市,潼南县,荣昌县','12307,12329,12310,12311,12312,12313,12314,12315,12316,12317,12318,12321,12322,12323,12324,12325,12326,12327,12330,12331,12332,12309,12319,12320,12328,12308');



citynum++;
area_value[citynum]='11909';
area_text[citynum]='青海';
city[26]=new Array('11909','海南藏族自治州,果洛藏族自治州,海西蒙古族藏族自治州,西宁,玉树藏族自治州,黄南藏族自治州,海北藏族自治州,海东','12165,12166,12167,12164,12163,12168,12162,12169');



citynum++;
area_value[citynum]='11911';
area_text[citynum]='四川';
city[27]=new Array('11911','阿坝藏族羌族自治州,成都,内江,凉山彝族自治州,遂宁,南充,广安,雅安,攀枝花,眉山,资阳,甘孜藏族自治州,泸州,广元,德阳,自贡,宜宾,达州,乐山,绵阳,巴中','12229,12243,12231,12232,12233,12235,12236,12237,12239,12240,12244,12246,12247,12248,12234,12238,12241,12245,12249,12242,12230');




citynum++;
area_value[citynum]='31959';
area_text[citynum]='广州';
city[28]=new Array('31959','白云区,黄埔区,南沙区,越秀区,天河区,花都区,从化市,增城市,萝岗区,番禺区,荔湾区,海珠区','31960,31961,31962,31963,31964,31971,31966,31967,31968,31969,31970,31965');



citynum++;
area_value[citynum]='32540';
area_text[citynum]='全国';
city[29]=new Array('32540','全国地区','32558');



citynum++;
area_value[citynum]='11881';
area_text[citynum]='宁夏';
city[30]=new Array('11881','中卫,固原,银川','12160,12159,12161');



citynum++;
area_value[citynum]='11894';
area_text[citynum]='江西';
city[31]=new Array('11894','上饶,抚州,景德镇,吉安,萍乡,鹰潭,九江,南昌,赣州,宜春','12123,12125,12126,12127,12124,12128,12132,12130,12131,12129');



citynum++;
area_value[citynum]='11904';
area_text[citynum]='山西';
city[32]=new Array('11904','晋城,长治,吕梁,临汾,忻州,朔州,晋中,阳泉,大同,运城,太原','12187,12188,12189,12192,12193,12191,12195,12196,12197,12190,12194');



citynum++;
area_value[citynum]='11883';
area_text[citynum]='陕西';
city[33]=new Array('11883','榆林,宝鸡,渭南,铜川,汉中,延安,咸阳,西安,商洛,安康','12198,12199,12200,12201,12206,12203,12207,12208,12204,12202');



citynum++;

