MODELS = {
  1 => '清包',
  2 => '半包',
  3 => '全包',
  4 => '设计工作室',
  5 => '装修监理'
}

STYLES = {
  1 => '现代简约',
  2 => '田园风格',
  3 => '欧美式',
  4 => '中式风格',
  5 => '地中海',
  6 => '混搭'
}

#去掉别墅
PRICE = {
  1 => '8万以下',
  2 => '8-15万',
  3 => '15-30万',
  4 => '30万-100万',
  5 => '100万以上'
}

NINBO_PRICE = {
  1 => '6万以下',
  2 => '6-10万',
  3 => '10-15万',
  4 => '30万-50万',
  5 => '50万以上',
  6 => '15-30万'
}



STAGE = {
  9 => '装修准备',
  1 => '风格设计',
  2 => '隐蔽工程',
  8 => '建材选购',
  3 => '泥瓦工程',
  4 => '木工工程',
  5 => '油漆工程',
  6 => '安装收尾',
  7 => '装修完工'
}

CITIES = {
  11910 => "上海",
  12117 => "苏州",
  12301 => "宁波",
  12306 => "杭州",
  12118 => "无锡",
  12122 => "南京",
  12243 => '成都',
  12109 => '长沙',
  11921 => '合肥',
  12112 => '常州',
  12121 => '淮安',
  12114 => '徐州',
  12093 => '武汉',
  12059 => '郑州',
  12173 => '青岛',
  11905 => '北京',
  11971 => '深圳',
  12243 => '成都',
  31959 => '广州',
  11971 => '深圳',
  12013 => '海口',
  11944 => '厦门',
  12208 => '西安',
  11887 => '天津',
  12194 => '太原',
  12030 => '石家庄',
  12288 => '昆明',
  12069 => '哈尔滨',
  12142 => '大连',
  11908 => '重庆',
  12349 => '长春'
}

TAGURLS = {
  0 => "",
  0 => "quanguo",
  11910 => "shanghai",
  12117 => "suzhou",
  12122 => "nanjing",
  12301 => "ningbo",
  12306 => "hangzhou",
  12118 => "wuxi",
  12093 => 'wuhan',
  12122 => 'nanjing',
  12173 => 'qingdao',
  12109 => 'changsha',
  11921 => 'hefei',
  12059 => 'zhengzhou',
  11905 => 'beijing',
  31959 => 'guangzhou',
  11971 => 'shenzhen',
  12013 => 'haikou',
  11944 => 'xiamen',
  12243 => 'chengdu',
  11908 => 'chongqing',
  11887 => 'tianjin',
  12349 => 'changchun',
  12142 => 'dalian',
  12069 => 'haerbin',
  12288 => 'kunming',
  12030 => 'shijiazhuang',
  12194 => 'taiyuan',
  12208 => 'xian'
}

CITY_QQ = {
  "上海"=>["471953858","8b464a29774c6aab17d59219603ed2b11f6ad069c6e465f30c18091969c775d6"],
  "苏州"=>["1219457765","58e7cc079a7c5c2f3c830ef632e9ea6bed44aee3a616fd63a74453f4e0c483c4"],
  "南京"=>["",""],
  "宁波"=>["1223486064","849271c5f10d529253b68bdcd0becf24e2ffe2c6ae8cae63030079a47329ac70"],
  "杭州"=>["724368062","a1c4eebdf6ce4d762385add081a912b3ee173d43fc7c45b5909cdf4490a4911d"],
  "无锡"=>["1258564371","0c84a2c4d0bc09392c8575a6d75b3119a6abae7ed634afc07c72c7c726bbc260"]
}

SPACE = {
  1 => '厨房',
  2 => '餐厅',
  3 => '客厅',
  4 => '卫生间',
  5 => '卧室',
  6 => '书房',
  7 => '儿童房', 
  8 => '衣帽间',
  9 => '阳台', 
  10 => '阁楼', 
  11 => '花园', 
  12 => '飘窗',
  13 => '储藏室', 
  14 => '阳光房' , 
  15 => '玄关', 
  16 => '过道', 
  17 => '其他'
}

FACTORY_FANGXING = {
  1 => '1房1厅',
  2 => '2房1厅',
  3 => '2房2厅',
  4 => '3房1厅',
  5 => '3房2厅',
  6 => '4房以上',
  7 => '复式',
  8 => '别墅',
  9 => '工装'
}

COUPON_CITIE_HANZI = {1 => '上海', 2 => '南京', 132 => '苏州', 223 => '杭州', 131 => '无锡', 214 => '宁波'}
COUPON_CITIE_PINYIN = {1 => 'shanghai', 2 => 'nanjing', 132 => 'suzhou', 223 => 'hangzhou', 131 => 'wuxi', 214 => 'ningbo'}

YUYUE_FROM_TYPE = {0 => '未知',1 => '首页本月预约排行榜',2 => '首页全程案例',3 => '首页实惠',4 => '公司列表在线预约',5 => '右侧预约排行榜',6 => '终端页免费设计咨询',7 => '公司对比',8 => '专题(装修省钱计划)',9 => '专题(免费量房)'}
GONGDI_FROM_TYPE = {0 => '未知',1 => '首页预约送车费',2 => '工作室预约工地',3 => '右侧预约工地',4 => '工作室在建工地列表',5 => '在建工地大列表',6 => '首页预约参观样板房',7 => '专题(装修省钱计划)',8 => '专题(预约送车费)'}
