class PaintQuestionnaire < Hejia::Db::Hejia
=begin
  C1 = [["A.一年之内","一年之内"],["B.半年之内","半年之内"],["C.三个月之内","三个月之内"],["D.一个月之内","一个月之内"],["E.没有装修计划","没有装修计划"]]
  C2 = [["A.近期/正在会进行墙面涂刷","近期/正在会进行墙面涂刷"],["B.近期不会进行墙面涂刷","近期不会进行墙面涂刷"]]
  C3 = [["A.近期/正在会进行家具涂刷","近期/正在会进行家具涂刷"],["B.近期不会进行家具涂刷","近期不会进行家具涂刷"]]
  C8 = [["A.非常感兴趣","非常感兴趣"],["B.比较感兴趣","比较感兴趣"],["C.无所谓","无所谓"],["D.不太感兴趣","不太感兴趣"],["E.完全不感兴趣","完全不感兴趣"]]
  C9 = [["A.肯定会","肯定会"],["B.可能会","可能会"],["C.不一定","不一定"],["D.可能不会","可能不会"],["E.肯定不会","肯定不会"]]
  C11 = [["A.知道","知道"],["B.不知道","不知道"]]
  C13 = [["A.干板展示（指涂刷了木器漆的木板样品）","干板展示（指涂刷了木器漆的木板样品）"],["B.演示工具","演示工具"],["C.施工录像","施工录像"]]
=end
=begin
          <li><label><input type="checkbox" value="checkbox" id="checkbox" name="checkbox">A.担心认证油工的技术不好</label></li>
          <li><label><input type="checkbox" value="checkbox" id="checkbox" name="checkbox">B. 担心认证油工的工资太高</label></li>
          <li><label><input type="checkbox" value="checkbox" id="checkbox" name="checkbox">C.担心认证机构的资质</label></li>
          <li><label><input type="checkbox" value="checkbox" id="checkbox" name="checkbox">D.其它（请注明）：</label><input type="text" name="" class="txtbox"></li>

=end
  C1 = ["A.一年之内","B.半年之内","C.三个月之内","D.一个月之内","E.没有装修计划"]
  C2 = ["A.近期/正在会进行墙面涂刷","B.近期不会进行墙面涂刷"]
  C3 = ["A.近期/正在会进行家具涂刷","B.近期不会进行家具涂刷"]
  C8 = ["A.非常感兴趣","B.比较感兴趣","C.无所谓","D.不太感兴趣","E.完全不感兴趣"]
  C9 = ["A.肯定会","B.可能会","C.不一定","D.可能不会","E.肯定不会"]
  C11 = ["A.知道","B.不知道"]
  C13 = ["A.干板展示（指涂刷了木器漆的木板样品）","B.演示工具","C.施工录像"]

  C4 = ["A.施工效果图片","B.普通施工注意事项","C.乳胶漆，木器漆特定产品涂刷注意事项","D.油漆工信息或介绍","E.油漆工价格","F.施工案例经验分享","G.没有明确目的","H.其它（请注明）："]
  C5 = ["A.装修公司","B.朋友亲戚介绍","C.网上寻找","D.找马路油漆工","E.油漆专卖店推荐","F.其它（请注明）："]
  C6 = ["A.油漆工施工案例","B.油漆工服务内容","C.售前咨询服务","D.售后服务保障","E.油漆工个人资质","F.其它（请注明）："]
  C7 = ["A.油漆工职业证书","B.油漆工的职业操守","C.油漆工理论知识","D.油漆工实际手艺","E.油漆工口碑","F.以上全选","G.其它（请注明）："]
  C91 = ["A.担心认证油工的技术不好","B.担心认证油工的工资太高","C.担心认证机构的资质","D.其它（请注明）："]
  C10 = ["A.只要通过理论考试","B.只要通过实操考试","C.只要通过道德理论考试","D.三者都要通过","E.无所谓"]
  C12 = ["A.不污染环境","B.气味小","C.对人体无害","D.抗划伤性","E.漆膜效果","F.价格"]
  C14 = ["A.结合板材或墙面的色彩推荐服务","B.打板服务（制作颜色样品供参考）","C.油漆工推荐服务","D.调色服务","E.技术指导服务","F.回访服务"]
  C15 = ["选 择","不选择","会考虑"]


  AGE = ["20~25岁","26~30岁","31~35岁","36~40岁","41~45岁","45~50岁","45~50岁"]
  EDUCATION = ["初中以下","初中","高中","大学本科（专科）","研究生","其它"]
  FN = ["1","2","3","4","5","5人以上"]
  INCOME = ["5000元以下","5000元-7000元","7000元-10000元","10000元-15000元","15000元-20000元","20000元人以上"]

end